configuration/src/InformationRegisters/UpdateHandlers/UpdateHandlers.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>UpdateHandlers</name>
  <resources>
    <name>Status</name>
    <type>
      <types>EnumRef.UpdateHandlersStatuses</types>
    </type>
  </resources>
  <resources>
    <name>Version</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>LibraryName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>DataRegistrationDuration</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ProcessingDuration</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ExecutionMode</name>
    <type>
      <types>EnumRef.HandlersExecutionModes</types>
    </type>
  </resources>
  <resources>
    <name>Order</name>
    <type>
      <types>EnumRef.OrderOfUpdateHandlers</types>
    </type>
  </resources>
  <attributes>
    <name>RegistrationVersion</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VersionOrder</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Id</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>AttemptCount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExecutionStatistics</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ErrorInfo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Priority</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CheckProcedure</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UpdateDataFillingProcedure</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DeferredProcessingQueue</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExecuteInMasterNodeOnly</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>RunAlsoInSubordinateDIBNodeWithFilters</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Multithreaded</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>BatchProcessingCompleted</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UpdateGroup</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>StartIteration</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DataToProcess</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>DeferredHandlerExecutionMode</name>
    <type>
      <types>EnumRef.DeferredHandlersExecutionModes</types>
    </type>
  </attributes>
  <attributes>
    <name>ObjectsToChange</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IsSeveritySeparationUsed</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IsUpToDateDataProcessed</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>HandlerName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Enums/UpdateHandlersStatuses/UpdateHandlersStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>UpdateHandlersStatuses</name>
  <enumValues>
    <name>Completed</name>
  </enumValues>
  <enumValues>
    <name>NotPerformed</name>
  </enumValues>
  <enumValues>
    <name>Running</name>
  </enumValues>
  <enumValues>
    <name>Paused</name>
  </enumValues>
  <enumValues>
    <name>Error</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Enums/DeferredHandlersExecutionModes/DeferredHandlersExecutionModes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>DeferredHandlersExecutionModes</name>
  <enumValues>
    <name>Sequentially</name>
  </enumValues>
  <enumValues>
    <name>Parallel</name>
  </enumValues>
</mdclass:Enum>

configuration/src/InformationRegisters/UpdateHandlers/Forms/ChoiceForm/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#Region EventHandlersForm

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	Title = NStr("en = 'Select handlers for deferred update restart';");
	
	SetConditionalAppearance();
	FillHandlerList(Parameters.SelectedHandlers.UnloadValues());
EndProcedure

#EndRegion

#Region HandlerListFormTableItemEventHandlers

&AtClient
Procedure HandlerListSelection(Item, RowSelected, Field, StandardProcessing)
	StandardProcessing = False;
	Item.CurrentData.Selected = Not Item.CurrentData.Selected;
EndProcedure

&AtClient
Procedure HandlerListBeforeDeleteRow(Item, Cancel)
	Cancel = True;
EndProcedure

&AtClient
Procedure HandlerListBeforeAddRow(Item, Cancel, Copy, Parent, Var_Group, Parameter)
	Cancel = True;
EndProcedure

&AtClient
Procedure HandlerListBeforeRowChange(Item, Cancel)
	If Item <> Undefined
		And Item.CurrentItem <> Undefined
		And Item.CurrentItem.Name = Items.Selected.Name Then
		Return;
	EndIf;
	
	
	Cancel = True;
EndProcedure

#EndRegion

#Region FormCommandHandlers

&AtClient
Procedure Done(Command)
	Close(SelectedHandlers());
EndProcedure

&AtClient
Procedure Select(Command)
	
	For Each RowID In Items.HandlerList.SelectedRows Do
		SelectedRow = HandlerList.FindByID(RowID);
		SelectedRow.Selected = True;
	EndDo;
	
EndProcedure

&AtClient
Procedure CancelSelect(Command)
	For Each RowID In Items.HandlerList.SelectedRows Do
		SelectedRow = HandlerList.FindByID(RowID);
		SelectedRow.Selected = False;
	EndDo;
EndProcedure

&AtClient
Procedure CancelAll(Command)
	SearchParameters = New Structure;
	SearchParameters.Insert("Selected", True);
	FoundRows = HandlerList.FindRows(SearchParameters);
	For Each String In FoundRows Do
		String.Selected = False;
	EndDo;
EndProcedure

#EndRegion

#Region Private

&AtServer
Procedure SetConditionalAppearance()
	
	ConditionalAppearance.Items.Clear();
	
	//
	Item = ConditionalAppearance.Items.Add();
	
	ItemField = Item.Fields.Items.Add();
	ItemField.Field = New DataCompositionField(Items.HandlerName.Name);
	ItemField = Item.Fields.Items.Add();
	ItemField.Field = New DataCompositionField(Items.Status.Name);
	ItemField = Item.Fields.Items.Add();
	ItemField.Field = New DataCompositionField(Items.Version.Name);
	
	ItemFilter = Item.Filter.Items.Add(Type("DataCompositionFilterItem"));
	ItemFilter.LeftValue = New DataCompositionField("HandlerList.Selected");
	ItemFilter.ComparisonType = DataCompositionComparisonType.Equal;
	ItemFilter.RightValue = True;
	Item.Appearance.SetParameterValue("BackColor", WebColors.HoneyDew);
	
EndProcedure

&AtServer
Procedure FillHandlerList(SelectedHandlers)
	Query = New Query;
	Query.SetParameter("Status", Enums.UpdateHandlersStatuses.Completed);
	Query.SetParameter("DeferredHandlerExecutionMode", Enums.DeferredHandlersExecutionModes.Parallel);
	Query.Text =
		"SELECT
		|	InformationRegisterUpdateHandlers.HandlerName AS HandlerName,
		|	InformationRegisterUpdateHandlers.Status AS Status,
		|	InformationRegisterUpdateHandlers.Version AS Version
		|FROM
		|	InformationRegister.UpdateHandlers AS InformationRegisterUpdateHandlers
		|WHERE
		|	InformationRegisterUpdateHandlers.Status = &Status
		|	AND InformationRegisterUpdateHandlers.DeferredHandlerExecutionMode = &DeferredHandlerExecutionMode";
	Handlers = Query.Execute().Unload();
	Handlers.Columns.Add("Selected", New TypeDescription("Boolean"));
	
	For Each SelectedHandler In SelectedHandlers Do
		FoundHandler = Handlers.Find(SelectedHandler, "HandlerName");
		FoundHandler.Selected = True;
	EndDo;
	
	ValueToFormAttribute(Handlers, "HandlerList");
EndProcedure

&AtServer
Function SelectedHandlers()
	
	FilterParameters = New Structure;
	FilterParameters.Insert("Selected", True);
	SelectedHandlers = HandlerList.Unload(FilterParameters, "HandlerName");
	
	Return SelectedHandlers.UnloadColumn("HandlerName");
	
EndFunction

#EndRegion
